## Plan changes
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 9 to change, 7 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.covidshield_key_retrieval_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_retrieval_task"  {
      ~ id       = "bfef57506e377a3f1357a87f171509ecbf099be42bc94931e8c71133f61ceed2" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "z8oP0NRnbJ8P1frPGQrd"
                        },
                    ]
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-read-only-url-0r6pob-vGtwqR"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # data.template_file.covidshield_key_submission_task will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "covidshield_key_submission_task"  {
      ~ id       = "7e5c7c8ced1906b3a2a03de7091a2d6f295497ab50441e8d87e8dfc46afe4f6c" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "true"
                        },
                    ]
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_ecs_cluster.covidshield will be updated in-place
  ~ resource "aws_ecs_cluster" "covidshield" {
        id                 = "arn:aws:ecs:ca-central-1:005133826942:cluster/CovidShield"
        name               = "CovidShield"
        tags               = {
            "CostCentre" = "CovidShield"
        }
        # (3 unchanged attributes hidden)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeyRetrieval:283" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRICS_USERNAME"
                          - value = "z8oP0NRnbJ8P1frPGQrd"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-retrieval"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeyRetrieval"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-retrieval"
                  - portMappings     = [
                      - {
                          - containerPort = 8001
                          - hostPort      = 8001
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "RETRIEVE_HMAC_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-hmac-key-0r6pob-oGGsIt"
                        },
                      - {
                          - name      = "ECDSA_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-retrieval-env-ecdsa-key-0r6pob-Dbo4Qd"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-read-only-url-0r6pob-vGtwqR"
                        },
                      - {
                          - name      = "METRICS_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-metric-password-0r6pob-3e5ppZ"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 283 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.covidshield_key_submission must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_submission" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeySubmission:280" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "ENABLE_TEST_TOOLS"
                          - value = "true"
                        },
                      - {
                          - name  = "ENV"
                          - value = "staging"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                    ]
                  - essential        = true
                  - image            = "005133826942.dkr.ecr.ca-central-1.amazonaws.com/covid-server/key-submission"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "CovidShield"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-KeySubmission"
                        }
                    }
                  - mountPoints      = []
                  - name             = "key-submission"
                  - portMappings     = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "KEY_CLAIM_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:key-submission-env-key-claim-token-0r6pob-q1ljoQ"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:005133826942:secret:server-database-url-0r6pob-fA6Kbq"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 1000000
                          - name      = "nofile"
                          - softLimit = 1000000
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "KeySubmission" -> (known after apply)
      ~ revision                 = 280 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_flow_log.cloud_based_sensor will be created
  + resource "aws_flow_log" "cloud_based_sensor" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + log_destination          = "arn:aws:s3:::cbs-satellite-005133826942/vpc_flow_logs/"
      + log_destination_type     = "s3"
      + log_format               = "${vpc-id} ${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status} ${subnet-id} ${instance-id}"
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + tags_all                 = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-06fbc7337b116cce1"
    }

  # aws_iam_role_policy.firehose_waf_logs will be updated in-place
  ~ resource "aws_iam_role_policy" "firehose_waf_logs" {
        id     = "firehose_waf_logs:firehose-waf-logs-policy"
        name   = "firehose-waf-logs-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::covid-shield-staging-waf-logs",
                          - "arn:aws:s3:::covid-shield-staging-waf-logs/*",
                          + "arn:aws:s3:::cbs-satellite-005133826942",
                          + "arn:aws:s3:::cbs-satellite-005133826942/*",
                        ]
                        # (3 unchanged elements hidden)
                    },
                    {
                        Action   = "iam:CreateServiceLinkedRole"
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::*:role/aws-service-role/wafv2.amazonaws.com/AWSServiceRoleForWAFV2Logging"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
      ~ arn            = "arn:aws:firehose:ca-central-1:005133826942:deliverystream/aws-waf-logs-covid-shield" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:ca-central-1:005133826942:deliverystream/aws-waf-logs-covid-shield" -> (known after apply)
      ~ name           = "aws-waf-logs-covid-shield" -> "aws-waf-logs-covid-shield-ca-central-1" # forces replacement
      ~ tags           = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      ~ tags_all       = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      ~ version_id     = "1" -> (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-005133826942"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/005133826942/"
          + role_arn           = "arn:aws:iam::005133826942:role/firehose_waf_logs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::covid-shield-staging-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::005133826942:role/firehose_waf_logs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs_us_east must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs_us_east" {
      ~ arn            = "arn:aws:firehose:us-east-1:005133826942:deliverystream/aws-waf-logs-covid-shield-us-east" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:us-east-1:005133826942:deliverystream/aws-waf-logs-covid-shield-us-east" -> (known after apply)
      ~ name           = "aws-waf-logs-covid-shield-us-east" -> "aws-waf-logs-covid-shield-us-east-1" # forces replacement
      ~ tags           = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      ~ tags_all       = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      ~ version_id     = "1" -> (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-005133826942"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/005133826942/"
          + role_arn           = "arn:aws:iam::005133826942:role/firehose_waf_logs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::covid-shield-staging-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::005133826942:role/firehose_waf_logs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb.covidshield_key_retrieval will be updated in-place
  ~ resource "aws_lb" "covidshield_key_retrieval" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-retrieval/50d87157735ad56c"
        name                       = "covidshield-key-retrieval"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-retrieval"
        }
        # (15 unchanged attributes hidden)

      ~ access_logs {
          ~ bucket  = "cbs-satellite-account-bucket005133826942" -> "cbs-satellite-005133826942"
          ~ prefix  = "005133826942/elb_logs_v2" -> "lb_logs"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lb.covidshield_key_submission will be updated in-place
  ~ resource "aws_lb" "covidshield_key_submission" {
        id                         = "arn:aws:elasticloadbalancing:ca-central-1:005133826942:loadbalancer/app/covidshield-key-submission/00743585bbc9c7b9"
        name                       = "covidshield-key-submission"
        tags                       = {
            "CostCentre" = "CovidShield"
            "Name"       = "covidshield-key-submission"
        }
        # (15 unchanged attributes hidden)

      ~ access_logs {
          ~ bucket  = "cbs-satellite-account-bucket005133826942" -> "cbs-satellite-005133826942"
          ~ prefix  = "005133826942/elb_logs_v2" -> "lb_logs"
            # (1 unchanged attribute hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket.cloudfront_logs will be updated in-place
  ~ resource "aws_s3_bucket" "cloudfront_logs" {
        id                          = "covid-shield-staging-cloudfront-logs"
        tags                        = {}
        # (10 unchanged attributes hidden)



      + logging {
          + target_bucket = "cbs-satellite-005133826942"
          + target_prefix = "s3_access_logs/covid-shield-staging-cloudfront-logs/"
        }
      - logging {
          - target_bucket = "cbs-satellite-account-bucket005133826942" -> null
          - target_prefix = "005133826942/s3_access_logs/covid-shield-staging-cloudfront-logs/" -> null
        }


        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.exposure_config will be updated in-place
  ~ resource "aws_s3_bucket" "exposure_config" {
        id                          = "covid-shield-exposure-config-staging"
        tags                        = {}
        # (10 unchanged attributes hidden)

      + logging {
          + target_bucket = "cbs-satellite-005133826942"
          + target_prefix = "s3_access_logs/covid-shield-exposure-config-staging/"
        }
      - logging {
          - target_bucket = "cbs-satellite-account-bucket005133826942" -> null
          - target_prefix = "005133826942/s3_access_logs/covid-shield-exposure-config-staging/" -> null
        }


        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.firehose_waf_logs will be updated in-place
  ~ resource "aws_s3_bucket" "firehose_waf_logs" {
        id                          = "covid-shield-staging-waf-logs"
        tags                        = {}
        # (10 unchanged attributes hidden)


      + logging {
          + target_bucket = "cbs-satellite-005133826942"
          + target_prefix = "s3_access_logs/covid-shield-staging-waf-logs/"
        }
      - logging {
          - target_bucket = "cbs-satellite-account-bucket005133826942" -> null
          - target_prefix = "005133826942/s3_access_logs/covid-shield-staging-waf-logs/" -> null
        }


        # (3 unchanged blocks hidden)
    }

  # aws_security_group.covidshield_database will be updated in-place
  ~ resource "aws_security_group" "covidshield_database" {
        id                     = "sg-06be84cecd0622042"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-01c8d2505904ab6c7",
                  - "sg-0dccc93503d5844ed",
                ]
              - self             = false
              - to_port          = 3306
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 3306
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05f8484d0adea8cf0",
                ]
              - self             = false
              - to_port          = 3306
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-01c8d2505904ab6c7",
                  + "sg-0dccc93503d5844ed",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "covidshield-database"
        tags                   = {
            "CostCentre" = "CovidShield"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_wafv2_web_acl.key_retrieval_cdn will be updated in-place
  ~ resource "aws_wafv2_web_acl" "key_retrieval_cdn" {
        id         = "c70e4ca5-1d56-4909-9611-b994a42d22fa"
        name       = "key_retrieval_cdn"
        tags       = {
            "CostCentre" = "CovidShield"
        }
        # (5 unchanged attributes hidden)


      - rule {
          - name     = "KeyRetrievalRateLimit" -> null
          - priority = 0 -> null

          - action {

              - block {
                }
            }

          - statement {

              - rate_based_statement {
                  - aggregate_key_type = "IP" -> null
                  - limit              = 10000 -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "KeyRetrievalRateLimit" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "KeyRetrievalRateLimit"
          + priority = 101

          + action {

              + block {
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 10000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "KeyRetrievalRateLimit"
              + sampled_requests_enabled   = true
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs" {
      ~ id                      = "arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_submission/a4a38f51-4df7-4869-b85d-c5efcad21975" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:ca-central-1:005133826942:deliverystream/aws-waf-logs-covid-shield",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_retrieval" {
      ~ id                      = "arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/key_retrieval/691f016d-bf45-4ae9-979a-a9df848ea422" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:ca-central-1:005133826942:deliverystream/aws-waf-logs-covid-shield",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_retrieval_cdn must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_retrieval_cdn" {
      ~ id                      = "arn:aws:wafv2:us-east-1:005133826942:global/webacl/key_retrieval_cdn/c70e4ca5-1d56-4909-9611-b994a42d22fa" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:us-east-1:005133826942:deliverystream/aws-waf-logs-covid-shield-us-east",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 8 to add, 9 to change, 7 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>